#define  __GLOBAL__
#include "..\bsp\bsp.h"

void Task_init(void);


/*------------------------------------------------------------------------------
 
 ------------------------------------------------------------------------------*/
int main(void)
{
  IO_pins_init();
  LEDstrip_init();

  // Без DMA эталонная длительность 1.001 мс , 
  // С включенным DMA длительность увеличивается до 1.003 т.е. на 0.2% 

  Timer4_init();                     // Таймер для организации генераци битовых посылок для светодиодной полосы
  DMA1_Stream7_Mem_to_TMR4_init();   // DMA организует пересылку данных в регистр CCR3 таймера TIM4 


  Running_LEDs_1();

}

/*------------------------------------------------------------------------------
  Задержка 1 мс
 ------------------------------------------------------------------------------*/
void Delay_ms(INT32U n)
{
  INT32U i;
  for (i=0;i<(n*4);i++)
  {
    memcpy((void *)buf1, (void *)buf2, ASIZE); // Задержка 250 мкс
  }
}


